NhanLe2426/STM32_MCU_Lab1/STM32_MCU_Lab1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define N_RED_LED_Pin GPIO_PIN_0
#define N_RED_LED_GPIO_Port GPIOA
#define N_YEL_LED_Pin GPIO_PIN_1
#define N_YEL_LED_GPIO_Port GPIOA
#define N_GRN_LED_Pin GPIO_PIN_2
#define N_GRN_LED_GPIO_Port GPIOA
#define E_RED_LED_Pin GPIO_PIN_3
#define E_RED_LED_GPIO_Port GPIOA
#define E_YEL_LED_Pin GPIO_PIN_4
#define E_YEL_LED_GPIO_Port GPIOA
#define E_GRN_LED_Pin GPIO_PIN_5
#define E_GRN_LED_GPIO_Port GPIOA
#define S_RED_LED_Pin GPIO_PIN_6
#define S_RED_LED_GPIO_Port GPIOA
#define S_YEL_LED_Pin GPIO_PIN_7
#define S_YEL_LED_GPIO_Port GPIOA
#define LED7_a_Pin GPIO_PIN_0
#define LED7_a_GPIO_Port GPIOB
#define LED7_b_Pin GPIO_PIN_1
#define LED7_b_GPIO_Port GPIOB
#define LED7_c_Pin GPIO_PIN_2
#define LED7_c_GPIO_Port GPIOB
#define S_GRN_LED_Pin GPIO_PIN_8
#define S_GRN_LED_GPIO_Port GPIOA
#define W_RED_LED_Pin GPIO_PIN_9
#define W_RED_LED_GPIO_Port GPIOA
#define W_YEL_LED_Pin GPIO_PIN_10
#define W_YEL_LED_GPIO_Port GPIOA
#define W_GRN_LED_Pin GPIO_PIN_11
#define W_GRN_LED_GPIO_Port GPIOA
#define LED7_d_Pin GPIO_PIN_3
#define LED7_d_GPIO_Port GPIOB
#define LED7_e_Pin GPIO_PIN_4
#define LED7_e_GPIO_Port GPIOB
#define LED7_f_Pin GPIO_PIN_5
#define LED7_f_GPIO_Port GPIOB
#define LED7_g_Pin GPIO_PIN_6
#define LED7_g_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
